Repository: mothal18/GarageCrew
Catalog: lib/l10n/app_*.arb
Languages: pl

# authSignInFailed
source: Sign in failed.
pl: Nie udało się zalogować.

# authSignInFailedWithCode
source: Sign in failed. Code: {code}
pl: Nie udało się zalogować. Kod: {code}

# authSignInFailedWithDetails
source: Sign in failed. Details: {details}
pl: Nie udało się zalogować. Szczegóły: {details}

# authTitle
source: Sign in
pl: Zaloguj się

# authSubtitle
source: Access your garage in one place.
pl: Dostęp do Twojego garażu w jednym miejscu.

# authLoginEmpty
source: Enter a login.
pl: Podaj login.

# authLoginInvalid
source: Login: 3-20 characters, a-z, 0-9 or _.
pl: Login: 3-20 znaków, a-z, 0-9 lub _.

# authPasswordLabel
source: Password
pl: Hasło

# authPasswordEmpty
source: Enter a password.
pl: Podaj hasło.

# authPasswordShort
source: Password must be at least 6 characters.
pl: Hasło musi mieć min. 6 znaków.

# authSignInButton
source: Sign in
pl: Zaloguj

# authCreateAccountButton
source: Create account
pl: Utwórz konto

# authFooter
source: By using the app you accept the terms and privacy policy.
pl: Korzystając z aplikacji akceptujesz regulamin i politykę prywatności.

# authBrandTagline
source: Manage your Hot Wheels collection like a pro.
pl: Zarządzaj kolekcją Hot Wheels jak profesjonalista.

# registerTitle
source: Register
pl: Rejestracja

# registerHeader
source: Create account
pl: Utwórz konto

# registerSubtitle
source: Join MyGarage and build your collection.
pl: Dołącz do MyGarage i buduj swoją kolekcję.

# registerEmailEmpty
source: Enter an email.
pl: Podaj email.

# registerEmailInvalid
source: Enter a valid email.
pl: Podaj poprawny email.

# registerPasswordLabel
source: Password
pl: Hasło

# registerPasswordEmpty
source: Enter a password.
pl: Podaj hasło.

# registerPasswordShort
source: Password must be at least 6 characters.
pl: Hasło musi mieć min. 6 znaków.

# registerCreateAccountButton
source: Create account
pl: Utwórz konto

# registerHaveAccount
source: Already have an account? Sign in
pl: Masz już konto? Zaloguj się

# registerSuccessTitle
source: Success!
pl: Sukces!

# registerCreatedCheckEmail
source: Account created. Check your email to confirm.
pl: Konto utworzone. Sprawdź maila, aby potwierdzić konto.

# registerLoginTaken
source: This login is already taken.
pl: Ten login jest już zajęty.

# registerCreateFailed
source: Couldn't create account. Try again.
pl: Nie udało się utworzyć konta. Spróbuj ponownie.

# settingsTitle
source: Settings
pl: Ustawienia

# settingsNoUser
source: No signed-in user.
pl: Brak zalogowanego użytkownika.

# settingsLoadFailed
source: Couldn't load settings.
pl: Nie udało się pobrać ustawień.

# settingsSaveGarageNameFailed
source: Couldn't save garage name.
pl: Nie udało się zapisać nazwy garażu.

# settingsSaveFailed
source: Couldn't save settings.
pl: Nie udało się zapisać ustawień.

# garageNameSection
source: Garage name
pl: Nazwa garażu

# garageNameLabel
source: Display name
pl: Nazwa wyświetlana

# garageNameHint
source: e.g. Mothal's Garage
pl: np. Garaż Mothal

# garageNameSaveTooltip
source: Save name
pl: Zapisz nazwę

# garageNameHelper
source: This name will be visible to others when the garage is public.
pl: Ta nazwa będzie widoczna dla innych po udostępnieniu garażu.

# publicGarageSection
source: Public garage
pl: Publiczny garaż

# publicGarageNoLogin
source: Your garage can be public.
pl: Twój garaż może być publiczny.

# publicGarageWithLogin
source: Your login: {login}
pl: Twój login: {login}

# publicGarageToggleTitle
source: Share my garage publicly
pl: Udostępnij mój garaż publicznie

# publicGarageToggleSubtitle
source: Others will be able to find your garage by login.
pl: Inni będą mogli znaleźć Twój garaż po loginie.

# carListSignOutFailed
source: Couldn't sign out. Try again.
pl: Nie udało się wylogować. Spróbuj ponownie.

# carListLoadFailed
source: Couldn't load cars.
pl: Nie udało się pobrać autek.

# carListSaveCarFailed
source: Couldn't save the car.
pl: Nie udało się zapisać autka.

# carListSaveChangesFailed
source: Couldn't save changes.
pl: Nie udało się zapisać zmian.

# carListDeleteFailed
source: Couldn't delete the car.
pl: Nie udało się usunąć autka.

# carLimitReached
source: You've reached the limit of {maxCars} cars in your garage.
pl: Osiągnięto limit {maxCars} autek w garażu.

# imageLimitReached
source: Maximum {maxImages} photos per car.
pl: Maksymalnie {maxImages} zdjęć na autko.

# networkError
source: No internet connection. Check your connection and try again.
pl: Brak połączenia z internetem. Sprawdź połączenie i spróbuj ponownie.

# unknownError
source: An unexpected error occurred. Please try again.
pl: Wystąpił nieoczekiwany błąd. Spróbuj ponownie.

# carDeleteTitle
source: Delete car?
pl: Usunąć autko?

# carDeleteContent
source: This car will be removed from your garage.
pl: To autko zostanie usunięte z Twojego garażu.

source: Cancel
pl: Anuluj

source: Delete
pl: Usuń

# settingsTooltip
source: Settings
pl: Ustawienia

# logoutTooltip
source: Sign out
pl: Wyloguj

# publicGaragesTooltip
source: Public garages
pl: Publiczne garaże

# garageEmpty
source: Your garage is empty.
pl: Twój garaż jest pusty.

source: Add car
pl: Dodaj autko

# searchNoResults
source: No results for this search.
pl: Brak wyników dla tego wyszukiwania.

# editCarTooltip
source: Edit car
pl: Edytuj autko

# deleteCarTooltip
source: Delete car
pl: Usuń autko

# searchGarageLabel
source: Search in garage
pl: Szukaj w garażu

# sortLabel
source: Sorting
pl: Sortowanie

# sortNewest
source: Newest
pl: Najnowsze

# sortOldest
source: Oldest
pl: Najstarsze

# addCarTitle
source: Add car
pl: Dodaj autko

# editCarTitle
source: Edit car
pl: Edytuj autko

source: Save
pl: Zapisz

# carDataSection
source: Car details
pl: Dane autka

# carNameLabel
source: Name / model
pl: Nazwa / model

# carNameEmpty
source: Enter a car name.
pl: Podaj nazwę autka.

# toyNumberLabel
source: Toy #
pl: Numer Toy

# toyNumberHint
source: e.g., JJJ02
pl: np. JJJ02

# toyNumberHelper
source: Format: 3 uppercase letters + 2 digits (ABC12)
pl: Format: 3 wielkie litery + 2 cyfry (ABC12)

# toyNumberEmpty
source: Enter Toy Number.
pl: Podaj numer Toy.

# toyNumberInvalidFormat
source: Invalid format. Use: 3 letters + 2 digits (e.g., JJJ02)
pl: Nieprawidłowy format. Użyj: 3 litery + 2 cyfry (np. JJJ02)

# toyNumberAlreadyExists
source: This Toy # already exists in your garage.
pl: Ten numer Toy już istnieje w Twoim garażu.

# toyNumberReminderAfterSearch
source: Don't forget to enter the Toy Number!
pl: Nie zapomnij wpisać numeru Toy!

# carDescriptionLabel
source: Description (optional)
pl: Opis (opcjonalnie)

# carImageUrlLabel
source: Image URL (optional)
pl: URL zdjęcia (opcjonalnie)

# hotWheelsSearchSection
source: Search Hot Wheels database
pl: Wyszukaj w bazie Hot Wheels

# hotWheelsSearchLabel
source: Search by name
pl: Szukaj po nazwie

# hotWheelsSearchFailed
source: Couldn't fetch results.
pl: Nie udało się pobrać wyników.

# hotWheelsSearchHint
source: Type at least 2 characters to search.
pl: Wpisz przynajmniej 2 znaki, aby wyszukać autko.

source: No results.
pl: Brak wyników.

source: Save changes
pl: Zapisz zmiany

source: Add to garage
pl: Dodaj do garażu

# useDataTooltip
source: Use data
pl: Użyj danych

# carDetailsTitle
source: Car details
pl: Szczegóły autka

source: No description.
pl: Brak opisu.

# imageUrlLabel
source: Image URL
pl: URL zdjęcia

# addedAtLabel
source: Added
pl: Dodano

# publicGaragesTitle
source: Public garages
pl: Publiczne garaże

# publicSearchLabel
source: Search by login or garage name
pl: Szukaj po loginie lub nazwie garażu

# publicSearchTooltip
source: Search
pl: Szukaj

# publicSearchHint
source: Type at least 2 characters to search for a garage.
pl: Wpisz co najmniej 2 znaki, aby wyszukać garaż.

# publicSearchNoResults
source: No results.
pl: Brak wyników.

# publicGarageSubtitle
source: Public garage
pl: Publiczny garaż

# publicGaragesLoadFailed
source: Couldn't load public garages.
pl: Nie udało się pobrać publicznych garaży.

# publicGarageCarsLoadFailed
source: Couldn't load cars.
pl: Nie udało się pobrać autek.

# publicGarageTitle
source: Garage: {login}
pl: Garaż: {login}

# publicGarageEmpty
source: This garage is empty.
pl: Ten garaż jest pusty.

# splashLoading
source: Loading...
pl: Ładowanie...

# splashLoadingError
source: Loading failed. Please try again.
pl: Błąd ładowania. Spróbuj ponownie.

# splashRetry
source: Try again
pl: Spróbuj ponownie

# appearanceSection
source: Appearance
pl: Wygląd

# darkModeToggleTitle
source: Dark mode
pl: Tryb ciemny

# darkModeToggleSubtitle
source: Switch to dark theme.
pl: Zmień motyw aplikacji na ciemny.

# racingThemeToggleTitle
source: Racing theme
pl: Motyw wyścigowy

# racingThemeToggleSubtitle
source: Colors inspired by the GarageCrew website.
pl: Kolorystyka inspirowana stroną GarageCrew.

# themeTooltip
source: Change theme
pl: Zmień motyw

# profileSection
source: Garage profile
pl: Profil garażu

# avatarUrlLabel
source: Profile image URL
pl: URL zdjęcia profilowego

# avatarUrlHint
source: https://example.com/image.jpg
pl: https://example.com/zdjecie.jpg

# avatarUrlSaveTooltip
source: Save image
pl: Zapisz zdjęcie

# avatarUrlHelper
source: Profile image visible on your garage.
pl: Zdjęcie profilowe widoczne przy Twoim garażu.

# avatarSaveFailed
source: Couldn't save profile image.
pl: Nie udało się zapisać zdjęcia profilowego.

# bioLabel
source: Profile description
pl: Opis profilu

# bioHint
source: Write something about yourself or your collection...
pl: Napisz coś o sobie lub swojej kolekcji...

# bioSaveTooltip
source: Save description
pl: Zapisz opis

# bioHelper
source: Short description visible on your profile.
pl: Krótki opis widoczny na Twoim profilu.

# bioSaveFailed
source: Couldn't save description.
pl: Nie udało się zapisać opisu.

# carsCount
source: {count} {count, plural, =1{car} other{cars}}
pl: {count} {count, plural, =1{autko} few{autka} other{autek}}

# noBio
source: No description.
pl: Brak opisu.

# pickImageTitle
source: Choose image
pl: Wybierz zdjęcie

# pickFromCamera
source: Take photo
pl: Zrób zdjęcie

# pickFromGallery
source: Choose from gallery
pl: Wybierz z galerii

# pickFromUrl
source: Enter URL
pl: Wpisz URL

# imageUploadFailed
source: Failed to upload image
pl: Nie udało się przesłać zdjęcia

# imageDeleteConfirm
source: Delete this image?
pl: Usunąć to zdjęcie?

# galleryEmpty
source: No images
pl: Brak zdjęć

source: Tap to add image
pl: Dotknij, aby dodać zdjęcie

# maxImagesReached
source: Maximum {count} images
pl: Maksymalnie {count} zdjęć

# imageUploading
source: Uploading...
pl: Przesyłanie...

# reorderImages
source: Drag to reorder
pl: Przeciągnij, aby zmienić kolejność

# carImagesSection
source: Car images
pl: Zdjęcia autka

# addImageButton
source: Add image
pl: Dodaj zdjęcie

# exploreGarages
source: Explore
pl: Szukaj

# notificationsTitle
source: Notifications
pl: Powiadomienia

# notificationsEmpty
source: No notifications
pl: Brak powiadomień

# notificationsMarkAllRead
source: Mark all read
pl: Oznacz wszystkie

# notificationsClearAll
source: Clear all
pl: Wyczyść wszystkie

# notificationsClearConfirmTitle
source: Clear all notifications?
pl: Wyczyścić wszystkie powiadomienia?

# notificationsClearConfirmContent
source: This will delete all notifications.
pl: Ta operacja usunie wszystkie powiadomienia.

source: Follow
pl: Obserwuj

source: Following
pl: Obserwujesz

# unfollowConfirmTitle
source: Unfollow?
pl: Przestać obserwować?

# unfollowConfirmContent
source: You won't receive notifications about new cars from this garage.
pl: Nie będziesz otrzymywać powiadomień o nowych autkach z tego garażu.

# followersCount
source: {count} {count, plural, =1{follower} other{followers}}
pl: {count} {count, plural, =1{obserwujący} other{obserwujących}}

# notificationBellTooltip
source: Notifications
pl: Powiadomienia

source: just now
pl: przed chwilą

# minutesAgo
source: {count} min ago
pl: {count} min temu

# hoursAgo
source: {count} h ago
pl: {count} godz. temu

# daysAgo
source: {count} d ago
pl: {count} dni temu

# notificationsSection
source: Notifications
pl: Powiadomienia

# notificationsToggleTitle
source: Enable notifications
pl: Włącz powiadomienia

# notificationsToggleSubtitle
source: Receive notifications about new cars and likes.
pl: Otrzymuj powiadomienia o nowych autkach i polubieniach.

# notificationsSaveFailed
source: Couldn't save notification settings.
pl: Nie udało się zapisać ustawień powiadomień.

# likesCount
source: {count} {count, plural, =1{like} other{likes}}
pl: {count} {count, plural, =1{polubienie} few{polubienia} other{polubień}}

# likeTooltip
source: Like
pl: Polub

# unlikeTooltip
source: Unlike
pl: Cofnij polubienie

# likedNotificationTitle
source: Someone liked your car
pl: Ktoś polubił Twoje autko

# likedNotificationBody
source: {login} liked: {carTitle}
pl: {login} polubił(a): {carTitle}

# quantityLabel
source: Quantity
pl: Ilość

# quantityHelper
source: How many copies of this variant
pl: Ile kopii tego wariantu posiadasz

# quantityEmpty
source: Enter quantity.
pl: Podaj ilość.

# quantityInvalid
source: Quantity must be at least 1.
pl: Ilość musi wynosić co najmniej 1.

# variantLabel
source: Variant (optional)
pl: Wariant (opcjonalnie)

# variantHint
source: e.g., Mint, Opened, TH
pl: np. Mint, Otwarty, TH

# variantHelper
source: Describe the condition or special edition
pl: Opisz stan lub specjalną edycję

source: Advanced filters
pl: Filtry zaawansowane

# toyNumberPrefixFilter
source: Toy # series
pl: Serie Toy #

# toyNumberPrefixAll
source: All series
pl: Wszystkie serie

# hasImagesFilter
source: Has images
pl: Ma zdjęcia

# hasImagesAll
source: All
pl: Wszystkie

# hasImagesYes
source: Yes
pl: Tak

# hasImagesNo
source: No
pl: Nie

# likesRangeFilter
source: Likes range
pl: Zakres polubień

# dateRangeFilter
source: Added
pl: Dodane

# dateRangeLast7Days
source: Last 7 days
pl: Ostatnie 7 dni

# dateRangeLast30Days
source: Last 30 days
pl: Ostatnie 30 dni

# dateRangeLast90Days
source: Last 90 days
pl: Ostatnie 90 dni

# dateRangeAllTime
source: All time
pl: Cały czas

source: Clear filters
pl: Wyczyść filtry

source: Showing {x} of {y} cars
pl: Wyświetlanie {x} z {y} autek

# statisticsTitle
source: Statistics
pl: Statystyki

# statisticsTooltip
source: View statistics
pl: Zobacz statystyki

# statisticsLoadFailed
source: Couldn't load statistics.
pl: Nie udało się pobrać statystyk.

# overviewSection
source: Overview
pl: Przegląd

# popularitySection
source: Popularity
pl: Popularność

# collectionSection
source: Collection
pl: Kolekcja

# activitySection
source: Activity
pl: Aktywność

source: Total cars
pl: Łącznie aut

source: Total likes
pl: Łącznie polubień

source: Most liked car
pl: Najbardziej lajkowane

source: Average likes
pl: Średnia polubień

# carsByToyNumber
source: By Toy # series
pl: Według serii Toy #

# carsWithImages
source: With images
pl: Ze zdjęciami

# carsAddedThisWeek
source: Added this week
pl: Dodane w tym tygodniu

# carsAddedThisMonth
source: Added this month
pl: Dodane w tym miesiącu

source: Collection age
pl: Wiek kolekcji

# collectionAgeDays
source: {days} {days, plural, =1{day} other{days}}
pl: {days} {days, plural, =1{dzień} few{dni} other{dni}}

source: Followers
pl: Obserwujący

# followingCount
source: Following
pl: Obserwowanych
